class BotText:
    start = (
        "⚡ Привет, {name}!\n\n"
        "📎 <b>Как добавить канал:</b>\n\n"
        "<b>1. Зайдите в нужный канал</b>\n"
        "<b>2.</b> Нажмите кнопку <b>«Администраторы»</b>"
        " в профиле канала, затем кнопку <b>«Добавить администратора»</b>\n"
        "<b>3. Добавьте этого бота</b> (<code>@StackSMM_Bot</code>) с правом на <b>«Управление сообщениями»</b>\n"
        "<b>4. Нажмите «Готово» под этим сообщением</b>"
    )

    ready_step = (
        "✅ <b>Отлично!</b>\n\n"
        "💫 Теперь нажмите кнопку <b>«Выбрать канал»</b> и выберите добавленный канал"
    )

    bot_kicked = (
        "❌ <b>Бота нет в этом канале!</b>\n\n"
        "📎 <b>Как добавить канал:</b>\n\n"
        "<b>1. Зайдите в нужный канал</b>\n"
        "<b>2.</b> Нажмите кнопку <b>«Администраторы»</b>"
        " в профиле канала, затем кнопку <b>«Добавить администратора»</b>\n"
        "<b>3. Добавьте этого бота</b> (<code>@StackSMM_Bot</code>) с правом на <b>«Управление сообщениями»</b>\n"
        "<b>4. Нажмите «Готово» под этим сообщением</b>"
    )

    added_channel = (
        "🎉 <b>Канал успешно добавлен!</b>\n\n"
        "🔥 Теперь он отобразиться в списке ваших каналов на сайте"
    )

    added_to_channel = (
        "🎉 <b>Вы добавлены в канал {channel_title}!</b>\n\n"
        "🔥 <b>{owner_name}</b> назначил(а) Вас <b>{role_name}</b>"
    )

    edited_to_channel = (
        "✏️ <b>Ваша роль в канале {channel_title} была изменена!</b>\n\n"
        "💫 <b>{owner_name}</b> назначил(а) Вас <b>{role_name}</b>"
    )

    error = ("❌ <b>Произошла ошибка!</b>\n\n"
             "{reason}")

    channel_already_added = "✅ <b>Канал уже добавлен</b>"
